# to update this: brew bundle --force cleanup
# Homebrew defaults
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

tap "1password/tap"
tap "aws/tap"
tap "nextdns/tap"
tap "teamookla/speedtest"

# Brew
brew "ansible"
brew "ffmpeg"
brew "figlet"
brew "groff"
brew "htop"
brew "libdvdcss"
brew "node"
brew "nextdns/tap/nextdns"
brew "teamookla/speedtest/speedtest"

# Casks
cask "1password-cli"
cask "docker"
cask "figma"
cask "postman"
cask "rar"

# VS Code
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "esbenp.prettier-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.remote-explorer"
vscode "oderwat.indent-rainbow"