# to update this: brew bundle --force cleanup
# to create a new one: brew bundle dump
# https://gist.github.com/ChristopherA/a579274536aab36ea9966f301ff14f3f

# Homebrew defaults
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

tap "1password/tap"
tap "aws/tap"
tap "teamookla/speedtest"

# Brew
brew "ansible"
brew "ffmpeg"
brew "figlet"
brew "gh"
brew "groff"
brew "htop"
brew "iperf3"
brew "libdvdcss"
brew "mas"
brew "node"
brew "wakeonlan"
brew "teamookla/speedtest/speedtest"

# Casks
cask "1password-cli"
cask "docker"
cask "figma"
cask "postman"
cask "rar"

# Mac App Store
# mas "1Password for Safari", id: 1569813296
# mas "GarageBand", id: 682658836
# mas "iMovie", id: 408981434
# mas "Infuse", id: 1136220934
# mas "Keynote", id: 409183694
# mas "Microsoft OneNote", id: 784801555
# mas "Microsoft Remote Desktop", id: 1295203466
# mas "NextDNS", id: 1464122853
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541
# mas "Slack", id: 803453959
# mas "Speedtest", id: 1153157709
# mas "WireGuard", id: 1451685025

# VS Code
# vscode "amazonwebservices.aws-toolkit-vscode"
# vscode "esbenp.prettier-vscode"
# vscode "github.codespaces"
# vscode "iancooper.code-zpl"
# vscode "ms-azuretools.vscode-docker"
# vscode "ms-python.debugpy"
# vscode "ms-python.python"
# vscode "ms-python.vscode-pylance"
# vscode "ms-vscode-remote.remote-containers"
# vscode "ms-vscode-remote.remote-ssh"
# vscode "ms-vscode-remote.remote-ssh-edit"
# vscode "ms-vscode-remote.remote-wsl"
# vscode "ms-vscode.remote-explorer"
# vscode "ms-vscode.remote-repositories"
# vscode "oderwat.indent-rainbow"
# vscode "redhat.vscode-xml"
# vscode "trunk.io"
# vscode "vue.volar"
